Practical No. 10 <br>
Title: Data Wrangling <br>
Name : Tavhare Ruchita Sharad <br>
Roll No : 61 <br>

In [45]:
import pandas as pd
import numpy as np

In [47]:
df = pd.read_csv("Mumbai House Prices.csv")

In [49]:
df.columns

Index(['bhk', 'type', 'locality', 'area', 'price', 'price_unit', 'region',
       'status', 'age'],
      dtype='object')

In [51]:
df.columns = df.columns.str.replace(' ', '_').str.replace('(', '').str.replace(')', '').str.lower()
df.columns

Index(['bhk', 'type', 'locality', 'area', 'price', 'price_unit', 'region',
       'status', 'age'],
      dtype='object')

In [53]:
df.head()

,bhk,type,locality,area,price,price_unit,region,status,age
0,3,Apartment,Lak And Hanware The Residency Tower,685,2.50,Cr,Andheri West,Ready to move,New
1,2,Apartment,Radheya Sai Enclave Building No 2,640,52.51,L,Naigaon East,Under Construction,New
2,2,Apartment,Romell Serene,610,1.73,Cr,Borivali West,Under Construction,New
3,2,Apartment,Soundlines Codename Urban Rainforest,876,59.98,L,Panvel,Under Construction,New
4,2,Apartment,Origin Oriana,659,94.11,L,Mira Road East,Under Construction,New

In [55]:
df.tail()

,bhk,type,locality,area,price,price_unit,region,status,age
76033,3,Apartment,Parinee Liva Roca,1527,7.00,Cr,Juhu,Ready to move,Unknown
76034,5,Apartment,Parinee Liva Roca,3049,12.00,Cr,Juhu,Ready to move,Unknown
76035,4,Apartment,Lodha Seaview,3313,10.00,Cr,Napeansea Road,Ready to move,Unknown
76036,2,Apartment,Hubtown Serene,1305,4.25,Cr,Bandra East,Ready to move,Unknown
76037,5,Apartment,Sunteck Signature Island,5200,25.00,Cr,Bandra Kurla Complex,Ready to move,Unknown

In [57]:
df.isnull().sum()

bhk           0
type          0
locality      0
area          0
price         0
price_unit    0
region        0
status        0
age           0
dtype: int64

In [59]:
additional_df =pd.read_csv("Mumbai House Prices.csv")
additional_df.columns

Index(['bhk', 'type', 'locality', 'area', 'price', 'price_unit', 'region',
       'status', 'age'],
      dtype='object')

In [61]:
additional_df.columns = additional_df.columns.str.replace(' ', '_').str.replace('(','').str.replace(')', '').str.lower()
additional_df.columns

Index(['bhk', 'type', 'locality', 'area', 'price', 'price_unit', 'region',
       'status', 'age'],
      dtype='object')

In [63]:
df_merged = pd.merge(df, additional_df, left_index=True, right_index=True, how='left')
print(df_merged)

       bhk_x     type_x                            locality_x  area_x  \
0          3  Apartment   Lak And Hanware The Residency Tower     685
1          2  Apartment     Radheya Sai Enclave Building No 2     640
2          2  Apartment                         Romell Serene     610
3          2  Apartment  Soundlines Codename Urban Rainforest     876
4          2  Apartment                         Origin Oriana     659
...      ...        ...                                   ...     ...
76033      3  Apartment                     Parinee Liva Roca    1527
76034      5  Apartment                     Parinee Liva Roca    3049
76035      4  Apartment                         Lodha Seaview    3313
76036      2  Apartment                        Hubtown Serene    1305
76037      5  Apartment              Sunteck Signature Island    5200

       price_x price_unit_x              region_x            status_x  \
0         2.50           Cr          Andheri West       Ready to move
1        52.51            L          Naigaon East  Under Construction
2         1.73           Cr         Borivali West  Under Construction
3        59.98            L                Panvel  Under Construction
4        94.11            L        Mira Road East  Under Construction
...        ...          ...                   ...                 ...
76033     7.00           Cr                  Juhu       Ready to move
76034    12.00           Cr                  Juhu       Ready to move
76035    10.00           Cr        Napeansea Road       Ready to move
76036     4.25           Cr           Bandra East       Ready to move
76037    25.00           Cr  Bandra Kurla Complex       Ready to move

         age_x  bhk_y     type_y                            locality_y  \
0          New      3  Apartment   Lak And Hanware The Residency Tower
1          New      2  Apartment     Radheya Sai Enclave Building No 2
2          New      2  Apartment                         Romell Serene
3          New      2  Apartment  Soundlines Codename Urban Rainforest
4          New      2  Apartment                         Origin Oriana
...        ...    ...        ...                                   ...
76033  Unknown      3  Apartment                     Parinee Liva Roca
76034  Unknown      5  Apartment                     Parinee Liva Roca
76035  Unknown      4  Apartment                         Lodha Seaview
76036  Unknown      2  Apartment                        Hubtown Serene
76037  Unknown      5  Apartment              Sunteck Signature Island

       area_y  price_y price_unit_y              region_y            status_y  \
0         685     2.50           Cr          Andheri West       Ready to move
1         640    52.51            L          Naigaon East  Under Construction
2         610     1.73           Cr         Borivali West  Under Construction
3         876    59.98            L                Panvel  Under Construction
4         659    94.11            L        Mira Road East  Under Construction
...       ...      ...          ...                   ...                 ...
76033    1527     7.00           Cr                  Juhu       Ready to move
76034    3049    12.00           Cr                  Juhu       Ready to move
76035    3313    10.00           Cr        Napeansea Road       Ready to move
76036    1305     4.25           Cr           Bandra East       Ready to move
76037    5200    25.00           Cr  Bandra Kurla Complex       Ready to move

         age_y
0          New
1          New
2          New
3          New
4          New
...        ...
76033  Unknown
76034  Unknown
76035  Unknown
76036  Unknown
76037  Unknown

[76038 rows x 18 columns]

In [67]:
df_filtered_location = df[df['locality'] == '3 Aces The Signature Tower']
df_filtered_location

,bhk,type,locality,area,price,price_unit,region,status,age
37908,2,Apartment,3 Aces The Signature Tower,806,1.24,Cr,Vikhroli,Under Construction,New
38720,2,Apartment,3 Aces The Signature Tower,887,1.26,Cr,Vikhroli,Under Construction,New
40773,2,Apartment,3 Aces The Signature Tower,806,1.14,Cr,Vikhroli,Under Construction,New
50529,2,Apartment,3 Aces The Signature Tower,815,1.22,Cr,Vikhroli,Ready to move,New
72135,1,Apartment,3 Aces The Signature Tower,593,78.99,L,Vikhroli,Under Construction,New
72136,2,Apartment,3 Aces The Signature Tower,700,1.07,Cr,Vikhroli,Under Construction,New

In [69]:
df_filtered_location.tail()

,bhk,type,locality,area,price,price_unit,region,status,age
38720,2,Apartment,3 Aces The Signature Tower,887,1.26,Cr,Vikhroli,Under Construction,New
40773,2,Apartment,3 Aces The Signature Tower,806,1.14,Cr,Vikhroli,Under Construction,New
50529,2,Apartment,3 Aces The Signature Tower,815,1.22,Cr,Vikhroli,Ready to move,New
72135,1,Apartment,3 Aces The Signature Tower,593,78.99,L,Vikhroli,Under Construction,New
72136,2,Apartment,3 Aces The Signature Tower,700,1.07,Cr,Vikhroli,Under Construction,New

In [73]:
print(df.columns)

Index(['bhk', 'type', 'locality', 'area', 'price', 'price_unit', 'region',
       'status', 'age'],
      dtype='object')

In [83]:
df_filtered_property_type = df[(df['area'] == 806) & (df['price'] >1.14)]
df_filtered_property_type.head()

,bhk,type,locality,area,price,price_unit,region,status,age
10374,2,Apartment,K Raheja Ascencio,806,1.98,Cr,Powai,Under Construction,New
10375,2,Apartment,K Raheja Ascencio,806,1.98,Cr,Powai,Under Construction,New
12355,2,Apartment,Mahaavir Pride,806,65.00,L,Dombivali,Under Construction,New
14470,2,Apartment,Chaitanya Anand Lunkhod CHSL,806,1.80,Cr,Andheri West,Under Construction,New
14657,1,Apartment,Space Residency,806,61.51,L,Mira Road East,Ready to move,Resale

In [85]:
df_filtered_property_type.tail()

,bhk,type,locality,area,price,price_unit,region,status,age
55745,2,Apartment,Swami Samarth Srishti Phase 2 Wing A,806,1.25,Cr,Bhandup West,Under Construction,Unknown
64279,2,Apartment,Ornate Kallisto Phase II,806,50.00,L,Bhiwandi,Under Construction,Unknown
66182,2,Apartment,Hiranandani Highland,806,2.50,Cr,Powai,Under Construction,Unknown
69881,2,Apartment,Neelkanth Valley II,806,38.00,L,Khopoli,Ready to move,Unknown
73691,2,Apartment,Paradise Sai Pearls,806,96.00,L,Kharghar,Ready to move,Unknown

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76038 entries, 0 to 76037
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bhk         76038 non-null  int64
 1   type        76038 non-null  object
 2   locality    76038 non-null  object
 3   area        76038 non-null  int64
 4   price       76038 non-null  float64
 5   price_unit  76038 non-null  object
 6   region      76038 non-null  object
 7   status      76038 non-null  object
 8   age         76038 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 5.2+ MB

In [91]:
df['locality'].unique()

array(['Lak And Hanware The Residency Tower',
       'Radheya Sai Enclave Building No 2', 'Romell Serene', ...,
       'Ahuja Prasadam Phase III', 'HBS Marineview', 'Hubtown Serene'],
      dtype=object)

In [93]:
df['area'].unique()

array([ 685,  640,  610, ..., 1974, 1634, 3049], dtype=int64)

In [95]:
df_encoded = pd.get_dummies(df, columns=['locality', 'area'])
df_encoded.head()

,bhk,type,price,price_unit,region,status,age,locality_ AJ Shri Jay,locality_ Akruti,locality_ Amber Heights,...,area_7800,area_7900,area_8000,area_8500,area_8900,area_9000,area_10000,area_10893,area_12400,area_16000
0,3,Apartment,2.50,Cr,Andheri West,Ready to move,New,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,2,Apartment,52.51,L,Naigaon East,Under Construction,New,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,2,Apartment,1.73,Cr,Borivali West,Under Construction,New,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,2,Apartment,59.98,L,Panvel,Under Construction,New,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,2,Apartment,94.11,L,Mira Road East,Under Construction,New,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [97]:
from sklearn.preprocessing import LabelEncoder

In [99]:
label_encoder = LabelEncoder()

In [105]:
df['locality_encoded'] = label_encoder.fit_transform(df['locality'])
df['area_encoded'] = label_encoder.fit_transform(df['area'])
df[['locality', 'locality_encoded', 'area', 'area_encoded']].head()

                               locality  locality_encoded  area  area_encoded
0   Lak And Hanware The Residency Tower              3019   685           489
1     Radheya Sai Enclave Building No 2              4965   640           444
2                         Romell Serene              7031   610           414
3  Soundlines Codename Urban Rainforest              8484   876           680
4                         Origin Oriana              4288   659           463

In [111]:
average_price_by_neighborhood = df.groupby('locality')['price'].mean().reset_index()
average_price_by_neighborhood

                   locality      price
0               AJ Shri Jay  62.000000
1                    Akruti  20.000000
2             Amber Heights  28.000000
3                    Arcade  62.375000
4               Asbury Park   3.266667
...                     ...        ...
9777            Zee Swastik   2.125000
9778              Zee Tulsi   3.500000
9779  Zinal Angel Residency  17.000000
9780       Zire The Kollage   3.785455
9781    Zoeb Aayesha Palace   1.000000

[9782 rows x 2 columns]

In [113]:
average_price_by_area_type = df.groupby('area')['price'].mean().reset_index()
average_price_by_area_type

       area      price
0       127  61.600000
1       136  31.000000
2       139  19.870000
3       149  28.702000
4       150  65.000000
...     ...        ...
2326   9000  30.000000
2327  10000  29.250000
2328  10893  55.550000
2329  12400  35.000000
2330  16000  46.666667

[2331 rows x 2 columns]

In [115]:
from scipy import stats

In [121]:
z_scores = stats.zscore(df['price'])
df['z_score'] = z_scores
z_scores

0       -0.817010
1        0.702901
2       -0.840412
3        0.929931
4        1.967215
           ...
76033   -0.680245
76034   -0.528285
76035   -0.589069
76036   -0.763824
76037   -0.133187
Name: price, Length: 76038, dtype: float64

In [163]:
outliers_z_score = df[(df['z_score'] > 2.14) | (df['z_score'] < -2.14)]

In [165]:
outliers_z_score

,bhk,type,locality,area,price,price_unit,region,status,age,Location_encoded,Area_Type_encoded,locality_encoded,area_encoded,z_score
10417,2,Apartment,Kalpataru Eternia At Kalpataru Parkcity,531,99.99,L,Thane West,Under Construction,New,2667,335,2667,335,2.145921
10418,2,Apartment,Kalpataru Eternia At Kalpataru Parkcity,531,99.99,L,Thane West,Under Construction,New,2667,335,2667,335,2.145921
10452,2,Apartment,Kalpataru Eternia At Kalpataru Parkcity,531,99.99,L,Thane West,Under Construction,New,2667,335,2667,335,2.145921
10453,2,Apartment,Kalpataru Eternia At Kalpataru Parkcity,531,99.99,L,Thane West,Under Construction,New,2667,335,2667,335,2.145921
14330,2,Apartment,Kalpataru Srishti Namaah,900,99.98,L,Mira Road East,Ready to move,Resale,2718,704,2718,704,2.145617
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
72538,2,Apartment,JP North,981,99.90,L,Mira Road East,Ready to move,New,2415,785,2415,785,2.143185
72861,3,Apartment,Runwal Gardens,918,99.99,L,Dombivali,Under Construction,New,7122,722,7122,722,2.145921
73245,3,Apartment,Runwal Gardens,918,99.99,L,Dombivali,Under Construction,New,7122,722,7122,722,2.145921
73483,2,Apartment,JP North,981,99.90,L,Mira Road East,Ready to move,New,2415,785,2415,785,2.143185
73599,2,Apartment,Paradigm Antalya,673,99.99,L,Jogeshwari West,Under Construction,Unknown,4387,477,4387,477,2.145921

In [167]:
df_cleaned = df[(df['z_score'] <= 3) & (df['z_score'] >= -3)]

In [169]:
df_cleaned = df_cleaned.drop(columns=['z_score'])
df_cleaned.head()

,bhk,type,locality,area,price,price_unit,region,status,age,Location_encoded,Area_Type_encoded,locality_encoded,area_encoded
0,3,Apartment,Lak And Hanware The Residency Tower,685,2.50,Cr,Andheri West,Ready to move,New,3019,489,3019,489
1,2,Apartment,Radheya Sai Enclave Building No 2,640,52.51,L,Naigaon East,Under Construction,New,4965,444,4965,444
2,2,Apartment,Romell Serene,610,1.73,Cr,Borivali West,Under Construction,New,7031,414,7031,414
3,2,Apartment,Soundlines Codename Urban Rainforest,876,59.98,L,Panvel,Under Construction,New,8484,680,8484,680
4,2,Apartment,Origin Oriana,659,94.11,L,Mira Road East,Under Construction,New,4288,463,4288,463